tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45k40_tdd.h
#define MSK11                         2207
#define SSP1ADD_MSK2                  2208
#define MSK21                         2209
#define MSK31                         2210
#define SSP1ADD_MSK3                  2211
#define SSP1ADD_MSK4                  2212
#define MSK41                         2213
#define MSK51                         2214
#define SSP1ADD_MSK5                  2215
#define SSP1ADD_MSK6                  2216
#define MSK61                         2217
#define MSK71                         2218
#define SSP1ADD_MSK7                  2219
#define SSP1MSK                       2220
#define SSP1MSK_MSK0                  2221
#define SSP1MSK_SSPMSK                2222
#define SSP1MSK_MSK1                  2223
#define SSP1MSK_MSK2                  2224
#define SSP1MSK_MSK3                  2225
#define SSP1MSK_MSK4                  2226
#define SSP1MSK_MSK5                  2227
#define SSP1MSK_MSK6                  2228
#define SSP1MSK_MSK7                  2229
#define SSP1STAT                      2230
#define BF1                           2231
#define SSP1STAT_BF                   2232
#define UA1                           2233
#define SSP1STAT_UA                   2234
#define SSP1STAT_R_NOT_W              2235
#define RW1                           2236
#define SSP1STAT_nW                   2237
#define RW                            2238
#define SSP1STAT_READ_WRITE           2239
#define SSP1STAT_nWRITE               2240
#define SSP1STAT_I2C_READ             2241
#define SSP1STAT_R_W                  2242
#define R                             2243
#define SSP1STAT_NOT_WRITE            2244
#define SSP1STAT_R_nW                 2245
#define SSP1STAT_S                    2246
#define START                         2247
#define START1                        2248
#define SSP1STAT_I2C_START            2249
#define STOP                          2250
#define SSP1STAT_P                    2251
#define STOP1                         2252
#define SSP1STAT_I2C_STOP             2253
#define SSP1STAT_D_NOT_A              2254
#define SSP1STAT_D_A                  2255
#define SSP1STAT_D_nA                 2256
#define SSP1STAT_NOT_ADDRESS          2257
#define SSP1STAT_DATA_ADDRESS         2258
#define SSP1STAT_nA                   2259
#define D                             2260
#define DA1                           2261
#define DA                            2262
#define SSP1STAT_nADDRESS             2263
#define SSP1STAT_I2C_DAT              2264
#define SSP1STAT_CKE                  2265
#define CKE1                          2266
#define SSP1STAT_SMP                  2267
#define SMP1                          2268
#define SSP1CON1                      2269
#define SSP1CON1_SSPM0                2270
#define SSPM01                        2271
#define SSP1CON1_SSPM                 2272
#define SSP1CON1_SSPM1                2273
#define SSPM11                        2274
#define SSP1CON1_SSPM2                2275
#define SSPM21                        2276
#define SSPM31                        2277
#define SSP1CON1_SSPM3                2278
#define SSP1CON1_CKP                  2279
#define CKP1                          2280
#define SSPEN1                        2281
#define SSP1CON1_SSPEN                2282
#define SSPOV1                        2283
#define SSP1CON1_SSPOV                2284
#define WCOL1                         2285
#define SSP1CON1_WCOL                 2286
#define SSP1CON2                      2287
#define SEN1                          2288
#define SSP1CON2_SEN                  2289
#define ADMSK11                       2290
#define SSP1CON2_RSEN                 2291
#define RSEN1                         2292
#define SSP1CON2_ADMSK1               2293
#define SSP1CON2_ADMSK                2294
#define SSP1CON2_PEN                  2295
#define ADMSK21                       2296
#define PEN1                          2297
#define SSP1CON2_ADMSK2               2298
#define ADMSK31                       2299
#define RCEN1                         2300
#define SSP1CON2_RCEN                 2301
#define SSP1CON2_ADMSK3               2302
#define SSP1CON2_ACKEN                2303
#define ACKEN1                        2304
#define ADMSK41                       2305
#define SSP1CON2_ADMSK4               2306
#define ACKDT1                        2307
#define ADMSK51                       2308
#define SSP1CON2_ACKDT                2309
#define SSP1CON2_ADMSK5               2310
#define SSP1CON2_ACKSTAT              2311
#define ACKSTAT1                      2312
#define GCEN1                         2313
#define SSP1CON2_GCEN                 2314
#define SSP1CON3                      2315
#define SSP1CON3_DHEN                 2316
#define SSP1CON3_AHEN                 2317
#define SSP1CON3_SBCDE                2318
#define SSP1CON3_SDAHT                2319
#define SSP1CON3_BOEN                 2320
#define SSP1CON3_SCIE                 2321
#define SSP1CON3_PCIE                 2322
#define SSP1CON3_ACKTIM               2323
#define RC1REG                        2324
#define TX1REG                        2325
#define SP1BRGL                       2326
#define SP1BRGH                       2327
#define RC1STA                        2328
#define RC1STA_RX9D                   2329
#define RCD8                          2330
#define RC1STA_OERR                   2331
#define RC1STA_FERR                   2332
#define RC1STA_ADDEN                  2333
#define RC1STA_CREN                   2334
#define RC1STA_SREN                   2335
#define RC1STA_RX9                    2336
#define RC8_9                         2337
#define RC9                           2338
#define RC1STA_SPEN                   2339
#define TX1STA                        2340
#define TXD8                          2341
#define TX1STA_TX9D                   2342
#define TX1STA_TRMT                   2343
#define TX1STA_BRGH                   2344
#define TX1STA_SENDB                  2345
#define TX1STA_SYNC                   2346
#define TX1STA_TXEN                   2347
#define TX1STA_TX9                    2348
#define TX8_9                         2349
#define TX1STA_CSRC                   2350
#define BAUD1CON                      2351
#define ABDEN1                        2352
#define BAUD1CON_ABDEN                2353
#define WUE1                          2354
#define BAUD1CON_WUE                  2355
#define BRG161                        2356
#define BAUD1CON_BRG16                2357
#define SCKP1                         2358
#define CKTXP                         2359
#define TXCKP                         2360
#define BAUD1CON_SCKP                 2361
#define TXCKP1                        2362
#define BAUD1CON_RCIDL                2363
#define RCMT1                         2364
#define RCIDL1                        2365
#define RCMT                          2366
#define BAUD1CON_ABDOVF               2367
#define ABDOVF1                       2368
#define PWM4DCL                       2369
#define PWM4DCL_PWMPW0                2370
#define PWM4DCL_DC                    2371
#define PWM4DC0                       2372
#define PWM4DCL_DC0                   2373
#define PWM4DCL_PWMPW1                2374
#define PWM4DC1                       2375
#define PWM4DCL_DC1                   2376
#define PWM4DCH                       2377
#define PWM4DCH_PWMPW2                2378
#define PWM4DCH_DC                    2379
#define PWM4DC2                       2380
#define PWM4DCH_DC2                   2381
#define PWM4DCH_PWMPW3                2382
#define PWM4DC3                       2383
#define PWM4DCH_DC3                   2384
#define PWM4DCH_PWMPW4                2385
#define PWM4DC4                       2386
#define PWM4DCH_DC4                   2387
#define PWM4DCH_PWMPW5                2388
#define PWM4DC5                       2389
#define PWM4DCH_DC5                   2390
#define PWM4DCH_PWMPW6                2391
#define PWM4DC6                       2392
#define PWM4DCH_DC6                   2393
#define PWM4DCH_PWMPW7                2394
#define PWM4DC7                       2395
#define PWM4DCH_DC7                   2396
#define PWM4DCH_PWMPW8                2397
#define PWM4DC8                       2398
#define PWM4DCH_DC8                   2399
#define PWM4DCH_PWMPW9                2400
#define PWM4DC9                       2401
#define PWM4DCH_DC9                   2402
#define PWM4CON                       2403
#define PWM4POL                       2404
#define PWM4CON_POL                   2405
#define PWM4CON_OUT                   2406
#define PWM4OUT                       2407
#define PWM4EN                        2408
#define PWM4CON_EN                    2409
#define PWM3DCL                       2410
#define PWM3DC0                       2411
#define PWM3DCL_PWMPW0                2412
#define PWM3DCL_DC0                   2413
#define PWM3DCL_DC                    2414
#define PWM3DC1                       2415
#define PWM3DCL_PWMPW1                2416
#define PWM3DCL_DC1                   2417
#define PWM3DCH                       2418
#define PWM3DC2                       2419
#define PWM3DCH_DC2                   2420
#define PWM3DCH_DC                    2421
#define PWM3DCH_PWMPW2                2422
#define PWM3DC3                       2423
#define PWM3DCH_DC3                   2424
#define PWM3DCH_PWMPW3                2425
#define PWM3DC4                       2426
#define PWM3DCH_DC4                   2427
#define PWM3DCH_PWMPW4                2428
#define PWM3DC5                       2429
#define PWM3DCH_DC5                   2430
#define PWM3DCH_PWMPW5                2431
#define PWM3DC6                       2432
#define PWM3DCH_DC6                   2433
#define PWM3DCH_PWMPW6                2434
#define PWM3DC7                       2435
#define PWM3DCH_DC7                   2436
#define PWM3DCH_PWMPW7                2437
#define PWM3DC8                       2438
#define PWM3DCH_DC8                   2439
#define PWM3DCH_PWMPW8                2440
#define PWM3DC9                       2441
#define PWM3DCH_DC9                   2442
#define PWM3DCH_PWMPW9                2443
#define PWM3CON                       2444
#define PWM3CON_POL                   2445
#define PWM3POL                       2446
#define PWM3CON_OUT                   2447
#define PWM3OUT                       2448
#define PWM3EN                        2449
#define PWM3CON_EN                    2450
#define CCPR2L                        2451
#define CCPR2L_RL                     2452
#define CCPR2H                        2453
#define CCPR2H_RH                     2454
#define CCP2CON                       2455
#define CCP2MODE                      2456
#define CCP2MODE0                     2457
#define CCP2CON_MODE0                 2458
#define CCP2CON_MODE                  2459
#define CCP2MODE1                     2460
#define CCP2CON_MODE1                 2461
#define CCP2MODE2                     2462
#define CCP2CON_MODE2                 2463
#define CCP2MODE3                     2464
#define CCP2CON_MODE3                 2465
#define CCP2FMT                       2466
#define CCP2CON_FMT                   2467
#define CCP2OUT                       2468
#define CCP2CON_OUT                   2469
#define CCP2EN                        2470
#define CCP2CON_EN                    2471
#define CCP2CAP                       2472
#define CCP2CAP_CTS                   2473
#define CCP2CAP_CTS0                  2474
#define CCP2CTS                       2475
#define CCP2CTS0                      2476
#define CCP2CAP_CTS1                  2477
#define CCP2CTS1                      2478
#define CCPR1L                        2479
#define CCPR1L_RL                     2480
#define CCPR1H                        2481
#define CCPR1H_RH                     2482
#define CCP1CON                       2483
#define CCP1MODE0                     2484
#define CCP1CON_MODE0                 2485
#define CCP1CON_MODE                  2486
#define CCP1MODE                      2487
#define CCP1MODE1                     2488
#define CCP1CON_MODE1                 2489
#define CCP1MODE2                     2490
#define CCP1CON_MODE2                 2491
#define CCP1MODE3                     2492
#define CCP1CON_MODE3                 2493
#define CCP1FMT                       2494
#define CCP1CON_FMT                   2495
#define CCP1CON_OUT                   2496
#define CCP1OUT                       2497
#define CCP1EN                        2498
#define CCP1CON_EN                    2499
#define P1M1                          2500
#define CCP1CAP                       2501
#define CCP1CTS0                      2502
#define CCP1CAP_CTS                   2503
#define CCP1CAP_CTS0                  2504
#define CCP1CTS                       2505
#define CCP1CTS1                      2506
#define CCP1CAP_CTS1                  2507
#define CCPTMRS                       2508
#define C1TSEL0                       2509
#define C1TSEL                        2510
#define C1TSEL1                       2511
#define C2TSEL0                       2512
#define C2TSEL                        2513
#define C2TSEL1                       2514
#define P3TSEL                        2515
#define P3TSEL0                       2516
#define P3TSEL1                       2517
#define P4TSEL0                       2518
#define P4TSEL                        2519
#define P4TSEL1                       2520
#define T6TMR                         2521
#define TMR6                          2522
#define T6PR                          2523
#define PR6                           2524
#define T6CON                         2525
#define T6CON_OUTPS0                  2526
#define T6OUTPS                       2527
#define T6CON_OUTPS                   2528
#define T6OUTPS0                      2529
#define T6CON_OUTPS1                  2530
#define T6OUTPS1                      2531
#define T6CON_OUTPS2                  2532
#define T6OUTPS2                      2533
#define T6CON_OUTPS3                  2534
#define T6OUTPS3                      2535
#define T6CON_CKPS0                   2536
#define T6CKPS                        2537
#define T6CKPS0                       2538
#define T6CON_CKPS                    2539
#define T6CON_CKPS1                   2540
#define T6CKPS1                       2541
#define T6CON_CKPS2                   2542
#define T6CKPS2                       2543
#define TMR6ON                        2544
#define T6ON                          2545
#define T6CON_ON                      2546
#define T6HLT                         2547
#define T6HLT_MODE0                   2548
#define T6HLT_MODE                    2549
#define T6MODE0                       2550
#define T6MODE                        2551
#define T6HLT_MODE1                   2552
#define T6MODE1                       2553
#define T6MODE2                       2554
#define T6HLT_MODE2                   2555
#define T6HLT_MODE3                   2556
#define T6MODE3                       2557
#define T6MODE4                       2558
#define T6HLT_MODE4                   2559
#define T6CKSYNC                      2560
#define T6HLT_CKSYNC                  2561
#define T6CKPOL                       2562
#define T6HLT_CKPOL                   2563
#define T6PSYNC                       2564
#define T6HLT_PSYNC                   2565
#define T6CLKCON                      2566
#define T6CS                          2567
#define T6CS0                         2568
#define T6CS1                         2569
#define T6CS2                         2570
#define T6CS3                         2571
#define T6RST                         2572
#define T6RST_RSEL                    2573
#define T6RST_RSEL0                   2574
#define T6RSEL                        2575
#define T6RSEL0                       2576
#define T6RST_RSEL1                   2577
#define T6RSEL1                       2578
#define T6RSEL2                       2579
#define T6RST_RSEL2                   2580
#define T6RST_RSEL3                   2581
#define T6RSEL3                       2582
#define T4TMR                         2583
#define TMR4                          2584
#define T4PR                          2585
#define PR4                           2586
#define T4CON                         2587
#define T4OUTPS0                      2588
#define T4CON_OUTPS                   2589
#define T4OUTPS                       2590
#define T4CON_OUTPS0                  2591
#define T4OUTPS1                      2592
#define T4CON_OUTPS1                  2593
#define T4CON_OUTPS2                  2594
#define T4OUTPS2                      2595
#define T4OUTPS3                      2596
#define T4CON_OUTPS3                  2597
#define T4CON_CKPS0                   2598
#define T4CKPS0                       2599
#define T4CON_CKPS                    2600
#define T4CKPS                        2601
#define T4CKPS1                       2602
#define T4CON_CKPS1                   2603
#define T4CKPS2                       2604
#define T4CON_CKPS2                   2605
#define T4ON                          2606
#define T4CON_ON                      2607
#define TMR4ON                        2608
#define T4HLT                         2609
#define T4MODE                        2610
#define T4HLT_MODE                    2611
#define T4HLT_MODE0                   2612
#define T4MODE0                       2613
#define T4HLT_MODE1                   2614
#define T4MODE1                       2615
#define T4HLT_MODE2                   2616
#define T4MODE2                       2617
#define T4HLT_MODE3                   2618
#define T4MODE3                       2619
#define T4HLT_MODE4                   2620
#define T4MODE4                       2621
#define T4HLT_CKSYNC                  2622
#define T4CKSYNC                      2623
#define T4HLT_CKPOL                   2624
#define T4CKPOL                       2625
#define T4PSYNC                       2626
#define T4HLT_PSYNC                   2627
#define T4CLKCON                      2628
#define T4CS0                         2629
#define T4CS                          2630
#define T4CS1                         2631
#define T4CS2                         2632
#define T4CS3                         2633
#define T4RST                         2634
#define T4RSEL0                       2635
#define T4RSEL                        2636
#define T4RST_RSEL                    2637
#define T4RST_RSEL0                   2638
#define T4RSEL1                       2639
#define T4RST_RSEL1                   2640
#define T4RSEL2                       2641
#define T4RST_RSEL2                   2642
#define T4RSEL3                       2643
#define T4RST_RSEL3                   2644
#define T2TMR                         2645
#define TMR2                          2646
#define T2PR                          2647
#define PR2                           2648
#define T2CON                         2649
#define T2OUTPS0                      2650
#define T2CON_OUTPS0                  2651
#define T2OUTPS                       2652
#define T2CON_OUTPS                   2653
#define T2OUTPS1                      2654
#define T2CON_OUTPS1                  2655
#define T2OUTPS2                      2656
#define T2CON_OUTPS2                  2657
#define T2OUTPS3                      2658
#define T2CON_OUTPS3                  2659
#define T2CKPS0                       2660
#define T2CON_CKPS                    2661
#define T2CKPS                        2662
#define T2CON_CKPS0                   2663
#define T2CKPS1                       2664
#define T2CON_CKPS1                   2665
#define T2CKPS2                       2666
#define T2CON_CKPS2                   2667
#define T2CON_ON                      2668
#define TMR2ON                        2669
#define T2ON                          2670
#define T2HLT                         2671
#define T2HLT_MODE                    2672
#define T2MODE                        2673
#define T2MODE0                       2674
#define T2HLT_MODE0                   2675
#define T2MODE1                       2676
#define T2HLT_MODE1                   2677
#define T2MODE2                       2678
#define T2HLT_MODE2                   2679
#define T2MODE3                       2680
#define T2HLT_MODE3                   2681
#define T2MODE4                       2682
#define T2HLT_MODE4                   2683
#define T2HLT_CKSYNC                  2684
#define T2CKSYNC                      2685
#define T2HLT_CKPOL                   2686
#define T2CKPOL                       2687
#define T2PSYNC                       2688
#define T2HLT_PSYNC                   2689
#define T2CLKCON                      2690
#define T2CS                          2691
#define T2CS0                         2692
#define T2CS1                         2693
#define T2CS2                         2694
#define T2CS3                         2695
#define T2RST                         2696
#define T2RSEL0                       2697
#define T2RST_RSEL                    2698
#define T2RSEL                        2699
#define T2RST_RSEL0                   2700
#define T2RSEL1                       2701
#define T2RST_RSEL1                   2702
#define T2RST_RSEL2                   2703
#define T2RSEL2                       2704
#define T2RSEL3                       2705
#define T2RST_RSEL3                   2706
#define TMR5L                         2707
#define TMR5L0                        2708
#define TMR5L1                        2709
#define TMR5L2                        2710
#define TMR5L3                        2711
#define TMR5L4                        2712
#define TMR5L5                        2713
#define TMR5L6                        2714
#define TMR5L7                        2715
#define TMR5H0                        2716
#define TMR5H                         2717
#define TMR5H1                        2718
#define TMR5H2                        2719
#define TMR5H3                        2720
#define TMR5H4                        2721
#define TMR5H5                        2722
#define TMR5H6                        2723
#define TMR5H7                        2724
#define T5CON                         2725
#define T5CON_ON                      2726
#define TMR5ON                        2727
#define T5CON_RD16                    2728
#define T5RD16                        2729
#define RD165                         2730
#define nT5SYNC                       2731
#define T5CON_nSYNC                   2732
#define T5CON_NOT_SYNC                2733
#define NOT_T5SYNC                    2734
#define T5CON_CKPS0                   2735
#define T5CON_CKPS                    2736
#define T5CKPS0                       2737
#define T5CON_CKPS1                   2738
#define T5CKPS1                       2739
#define T5GCON                        2740
#define T5GCON_GVAL                   2741
#define T5GVAL                        2742
#define T5GGO_nDONE                   2743
#define T5GCON_GGO_NOT_DONE           2744
#define T5GCON_GGO_nDONE              2745
#define T5GGO_NOT_DONE                2746
#define T5GGO                         2747
#define T5GCON_GSPM                   2748
#define T5GSPM                        2749
#define T5GTM                         2750
#define T5GCON_GTM                    2751
#define T5GPOL                        2752
#define T5GCON_GPOL                   2753
#define T5GCON_GE                     2754
#define T5GE                          2755
#define T5GATE                        2756
#define T5GATE_GSS0                   2757
#define T5GSS0                        2758
#define T5GATE_GSS                    2759
#define T5GATE_GSS1                   2760
#define T5GSS1                        2761
#define T5GATE_GSS2                   2762
#define T5GSS2                        2763
#define T5GATE_GSS3                   2764
