tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45k40_tdd.h
#define T5GSS3                        2765
#define T5CLK                         2766
#define T5CS0                         2767
#define T5CLK_CS                      2768
#define T5CLK_CS0                     2769
#define T5CS1                         2770
#define T5CLK_CS1                     2771
#define T5CS2                         2772
#define T5CLK_CS2                     2773
#define T5CS3                         2774
#define T5CLK_CS3                     2775
#define TMR3L0                        2776
#define TMR3L                         2777
#define TMR3L1                        2778
#define TMR3L2                        2779
#define TMR3L3                        2780
#define TMR3L4                        2781
#define TMR3L5                        2782
#define TMR3L6                        2783
#define TMR3L7                        2784
#define TMR3H                         2785
#define TMR3H0                        2786
#define TMR3H1                        2787
#define TMR3H2                        2788
#define TMR3H3                        2789
#define TMR3H4                        2790
#define TMR3H5                        2791
#define TMR3H6                        2792
#define TMR3H7                        2793
#define T3CON                         2794
#define T3CON_ON                      2795
#define TMR3ON                        2796
#define T3CON_RD16                    2797
#define RD163                         2798
#define T3RD16                        2799
#define T3CON_NOT_SYNC                2800
#define T3CON_nSYNC                   2801
#define NOT_T3SYNC                    2802
#define nT3SYNC                       2803
#define T3CKPS0                       2804
#define T3CON_CKPS0                   2805
#define T3CON_CKPS                    2806
#define T3CKPS1                       2807
#define T3CON_CKPS1                   2808
#define T3GCON                        2809
#define T3GVAL                        2810
#define T3GCON_GVAL                   2811
#define T3GGO                         2812
#define T3GGO_NOT_DONE                2813
#define T3GCON_GGO_nDONE              2814
#define T3GGO_nDONE                   2815
#define T3GCON_GGO_NOT_DONE           2816
#define T3GCON_GSPM                   2817
#define T3GSPM                        2818
#define T3GCON_GTM                    2819
#define T3GTM                         2820
#define T3GCON_GPOL                   2821
#define T3GPOL                        2822
#define T3GCON_GE                     2823
#define T3GE                          2824
#define T3GATE                        2825
#define T3GSS0                        2826
#define T3GATE_GSS0                   2827
#define T3GATE_GSS                    2828
#define T3GSS1                        2829
#define T3GATE_GSS1                   2830
#define T3GSS2                        2831
#define T3GATE_GSS2                   2832
#define T3GSS3                        2833
#define T3GATE_GSS3                   2834
#define T3CLK                         2835
#define T3CLK_CS                      2836
#define T3CLK_CS0                     2837
#define T3CS0                         2838
#define T3CLK_CS1                     2839
#define T3CS1                         2840
#define T3CLK_CS2                     2841
#define T3CS2                         2842
#define T3CS3                         2843
#define T3CLK_CS3                     2844
#define TMR1L                         2845
#define TMR1L0                        2846
#define TMR1L1                        2847
#define TMR1L2                        2848
#define TMR1L3                        2849
#define TMR1L4                        2850
#define TMR1L5                        2851
#define TMR1L6                        2852
#define TMR1L7                        2853
#define TMR1H0                        2854
#define TMR1H                         2855
#define TMR1H1                        2856
#define TMR1H2                        2857
#define TMR1H3                        2858
#define TMR1H4                        2859
#define TMR1H5                        2860
#define TMR1H6                        2861
#define TMR1H7                        2862
#define T1CON                         2863
#define TMR1ON                        2864
#define T1CON_ON                      2865
#define T1CON_RD16                    2866
#define T1RD16                        2867
#define NOT_T1SYNC                    2868
#define T1CON_nSYNC                   2869
#define nT1SYNC                       2870
#define T1CON_NOT_SYNC                2871
#define T1CON_CKPS0                   2872
#define T1CKPS0                       2873
#define T1CON_CKPS                    2874
#define T1CKPS1                       2875
#define T1CON_CKPS1                   2876
#define T1GCON                        2877
#define T1GCON_GVAL                   2878
#define T1GVAL                        2879
#define T1GGO_NOT_DONE                2880
#define T1GGO_nDONE                   2881
#define T1GCON_GGO_nDONE              2882
#define T1GCON_GGO_NOT_DONE           2883
#define T1GGO                         2884
#define T1GCON_GSPM                   2885
#define T1GSPM                        2886
#define T1GTM                         2887
#define T1GCON_GTM                    2888
#define T1GPOL                        2889
#define T1GCON_GPOL                   2890
#define T1GCON_GE                     2891
#define T1GE                          2892
#define T1GATE                        2893
#define T1GATE_GSS0                   2894
#define T1GSS0                        2895
#define T1GATE_GSS                    2896
#define T1GATE_GSS1                   2897
#define T1GSS1                        2898
#define T1GSS2                        2899
#define T1GATE_GSS2                   2900
#define T1GSS3                        2901
#define T1GATE_GSS3                   2902
#define T1CLK                         2903
#define T1CS0                         2904
#define T1CLK_CS                      2905
#define T1CLK_CS0                     2906
#define T1CLK_CS1                     2907
#define T1CS1                         2908
#define T1CS2                         2909
#define T1CLK_CS2                     2910
#define T1CS3                         2911
#define T1CLK_CS3                     2912
#define TMR0L0                        2913
#define TMR0L                         2914
#define TMR0L1                        2915
#define TMR0L2                        2916
#define TMR0L3                        2917
#define TMR0L4                        2918
#define TMR0L5                        2919
#define TMR0L6                        2920
#define TMR0L7                        2921
#define TMR0H0                        2922
#define T0PR                          2923
#define TMR0H                         2924
#define T0PR0                         2925
#define TMR0H1                        2926
#define T0PR1                         2927
#define TMR0H2                        2928
#define T0PR2                         2929
#define TMR0H3                        2930
#define T0PR3                         2931
#define TMR0H4                        2932
#define T0PR4                         2933
#define TMR0H5                        2934
#define T0PR5                         2935
#define TMR0H6                        2936
#define T0PR6                         2937
#define TMR0H7                        2938
#define T0PR7                         2939
#define T0CON0                        2940
#define T0OUTPS                       2941
#define T0OUTPS0                      2942
#define T0OUTPS1                      2943
#define T0OUTPS2                      2944
#define T0OUTPS3                      2945
#define T016BIT                       2946
#define T0OUT                         2947
#define T0EN                          2948
#define T0CON1                        2949
#define T0PS                          2950
#define T0CKPS                        2951
#define T0CKPS0                       2952
#define T0PS0                         2953
#define T0CKPS1                       2954
#define T0PS1                         2955
#define T0CKPS2                       2956
#define T0PS2                         2957
#define T0CKPS3                       2958
#define T0PS3                         2959
#define T0ASYNC                       2960
#define T0CS                          2961
#define T0CS0                         2962
#define T0CS1                         2963
#define T0CS2                         2964
#define PCON0                         2965
#define BOR                           2966
#define NOT_BOR                       2967
#define nBOR                          2968
#define POR                           2969
#define nPOR                          2970
#define NOT_POR                       2971
#define nRI                           2972
#define NOT_RI                        2973
#define RI                            2974
#define NOT_RMCLR                     2975
#define nRMCLR                        2976
#define RMCLR                         2977
#define NOT_RWDT                      2978
#define nRWDT                         2979
#define RWDT                          2980
#define nWDTWV                        2981
#define WDTWV                         2982
#define NOT_WDTWV                     2983
#define STKUNF                        2984
#define STKOVF                        2985
#define STATUS                        2986
#define C                             2987
#define CARRY                         2988
#define STATUS_DC                     2989
#define ZERO                          2990
#define Z                             2991
#define OV                            2992
#define OVERFLOW                      2993
#define N                             2994
#define NEGATIVE                      2995
#define PD                            2996
#define nPD                           2997
#define NOT_PD                        2998
#define TO                            2999
#define NOT_TO                        3000
#define nTO                           3001
#define FSR2L                         3002
#define PLUSW2                        3003
#define PREINC2                       3004
#define POSTDEC2                      3005
#define POSTINC2                      3006
#define INDF2                         3007
#define FSR1L                         3008
#define PLUSW1                        3009
#define PREINC1                       3010
#define POSTDEC1                      3011
#define POSTINC1                      3012
#define INDF1                         3013
#define WREG                          3014
#define FSR0L                         3015
#define PLUSW0                        3016
#define PREINC0                       3017
#define POSTDEC0                      3018
#define POSTINC0                      3019
#define INDF0                         3020
#define INTCON                        3021
#define INT0EDG                       3022
#define INT1EDG                       3023
#define INT2EDG                       3024
#define IPEN                          3025
#define PEIE                          3026
#define PEIE_GIEL                     3027
#define GIEL                          3028
#define GIE                           3029
#define GIE_GIEH                      3030
#define GIEH                          3031
#define PRODL                         3032
#define PRODH                         3033
#define TABLAT                        3034
#define TBLPTRL                       3035
#define TBLPTRH                       3036
#define TBLPTRU                       3037
#define ACSS                          3038
#define PCL                           3039
#define PCLATH                        3040
#define PCLATH_PCH                    3041
#define PCLATU                        3042
#define PCU                           3043
#define STKPTR0                       3044
#define STKPTR                        3045
#define SP0                           3046
#define STKPTR1                       3047
#define SP1                           3048
#define STKPTR2                       3049
#define SP2                           3050
#define SP3                           3051
#define STKPTR3                       3052
#define STKPTR4                       3053
#define SP4                           3054
#define STKPTR5                       3055
#define SP5                           3056
#define TOSL                          3057
#define TOSH                          3058

#endif // _PIC18LF45K40_H_
